Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: Managing Animations
ja: アニメーションを管理する

source: Managing DTD Identifiers
ja: DTD識別子を管理する

source: Managing Delegates
ja: 委任先を管理する

source: Managing Document Attributes
ja: 文書属性を管理する

source: Managing Namespaces
ja: 名前空間を管理する

source: Managing Parser Behavior
ja: パーサー挙動を管理する

source: Managing XML Node Objects
ja: XMLノードオブジェクトを管理する

source: Managing the DTD Node Kind
ja: DTDノード種類を管理する

source: Managing the Data
ja: データを管理する

source: Managing the Root Element
ja: ルート要素を管理する

source: Managing the Subscription
ja: サブスクリプションを管理する

source: Managing the View Hierarchy
ja: ビュー階層を管理する

source: Manipulating Child Elements
ja: 子要素を操作する

source: Manipulating Child Nodes
ja: 子ノードを操作する

source: Masking and Clipping Views
ja: ビューを隠すおよび切り抜く

source: Masks this view using the alpha channel of the given view.
ja: このビューをこの与えられたビューのアルファチャンネルを使って隠します。

source: Matches events as long as the user holds down the modifier keys corresponding to the given modifiers option set.
ja: 与えられた修飾子オプションセットに対応している修飾子キーをユーザが押し続ける限りイベントを適合させます。

source: Medium brightness regions become a partially opaque gray color.
ja: 中間の明るさの領域は、ある程度不透明灰色になります。

source: Medium sensitivity.
ja: 中感度。

source: Menu Button Styles
ja: メニューボタンスタイル

source: Methods to Override
ja: メソッドのオーバーライド

source: Model Sequenced Gesture States
ja: 配列されたジェスチャ状態それらを形作る

source: Modes
ja: モード

source: Modes for compositing a view with overlapping content.
ja: あるビューをオーバーラッブ内容と合成するモード。

source: Modifier Keys
ja: 修飾子キー

source: Modifiers typically work by wrapping the view instance on which you call them in another view with the specified characteristics.
ja: それら修飾子は、概してビューインスタンスをラップすることによって働きます、それの上であなたはその指定された特徴をもつ別のビューにおいてそれらを呼び出します。

source: Modifying the Frame Rectangle
ja: フレーム矩形を修正する

source: Monitoring Published Changes
ja: 出版された変化を監視する

source: Monitoring Scanner Progress
ja: スキャナー進捗を監視する

source: Move the data represented by the drag items instead of copying it.
ja: ドラッグ項目によって表されるデータを移動します、それをコピーするのではなく。

source: Multiple visible bars may each specify a principal view, but the system only honors one of them.
ja: 複数の可視のバーは、それぞれに主役ビューを指定するかもしれません、しかしシステムはそれらの１つに栄誉を与えるだけです。

source: Multiplies each component of this value by the given value.
ja: この値の各構成要素をこの与えられた値で乗算します。

source: NSString Handling Exception Names
ja: NSStringが取り扱う例外の名前

source: NSViewControllerRepresentable Implementations
ja: NSViewControllerRepresentable実装

source: NSViewRepresentable Implementations
ja: NSViewRepresentable実装

source: Named value transformers defined by NSValueTransformer.
ja: NSValueTransformerによって定義される名前付値変換子。

source: Namespace support was implemented in XMLParser starting in macOS 10.4.
ja: 名前空間サポートは、XMLParserにおいてmacOS 10.4で始まって実装されました。

source: Namespace-related methods of XMLParser prior to this version have no effect.
ja: このバージョンより前のXMLParserの名前空間関連メソッドは、効果を持ちません。

source: Navigating the Tree of Nodes
ja: ノードのツリーを閲覧する

source: Navigation Styles
ja: ナビゲーションスタイル

source: Negative numbers are to the left and positive numbers are to the right.
ja: 負の数は左の方にします、そして正の数は右の方にします。

source: Negative numbers are to the left and up; positive numbers are to the right and down.
ja: 負の数は左および上の方にします；正の数は右および下の方にします。

source: Negative numbers are up and positive numbers are down.
ja: 負の数は上の方にします、そして正の数は下の方にします。

source: Negative values invert colors in addition to applying contrast.
ja: 負の値は、コントラストの適用に加えて、色を反転します。

source: New
ja: 新規

source: New namespaces are created by adding an @Namespace() variable to a View type and reading its value in the view’s body method.
ja: 新しい名前空間は、@Namespace()変数をView型に加えることそしてそれの値をそのビューのもつ本文メソッドの中で読み出すことによって作成されます。

source: No overview available.
ja: 概要は利用可能でありません。

source: Node objects can be of different kinds, corresponding to the following markup constructs in an XML document: element, attribute, text, processing instruction, namespace, and comment.
ja: ノードオブジェクトは、異なる種類のものであることができます、XML書類の中の以下のマークアップ構成体：要素、属性、テキスト、処理命令、名前空間、そしてコメントに対応しています。

source: None
ja: 無し

source: Note
ja: 注意

source: Note that most alignment values have no apparent effect when the size of the frame happens to match that of this view.
ja: ほとんどの整列値は外見上の効果を、フレームのサイズが偶然このビューのそれと合致する場合には持たないことに注意してください。

source: Note that the Text element used as a label alongside the Slider retains its default color.
ja: Sliderのかたわらにラベルとして使われるText要素は、それの省略時の色を保ったままです。

source: Note that the actions invoked by the menu selection could be coded directly inside the button closures or, as shown below, invoked via function references.
ja: メニュー選択によって発動されるアクションは、直接にボタンクロージャ内部でコード化されるまたは、下で示されるように、関数参照を経由して発動されることができることに注意してください。

source: Note that you can safely set the root element of the XML document (using the NSXMLDocument setRootElement(_:)method) to be an instance of your subclass because this method only checks to see if the added node is of an element kind (NSXMLElementKind).
ja: 注意してください、あなたは何の問題もなくXML書類のルート要素が（NSXMLDocumentのsetRootElement(_:)メソッドを使って）あなたのサブクラスのインスタンスであると設定できます、なぜならこのメソッドは加えられたノードが要素種類（NSXMLElementKind）のものであるか見るために調べるだけだからです。

source: Notifications
ja: 通知

source: Notifies the view controller that its view is about to be added to a view hierarchy.
ja: それのビューがもうすぐあるビュー階層に加えられることをビューコントローラに通知します。

source: Now that the shorterIndices array holds the indices of the shorter names in the names set, you can use those indices to access elements in the set.
ja: 現在、shorterIndices配列はnames集合の中の短い名前のインデックスを保持します、あなたはそれらのインデックスを使って集合の中の要素にアクセスできます。

source: Object Data
ja: オブジェクトデータ

source: Object Runtime
ja: オブジェクトランタイム

source: Objects implement this method by calling isEqual(_:) on the lhs parameter.
ja: オブジェクトは、このメソッドをisEqual(_:)をlhsパラメータ上で呼び出すことによって実装します。

source: Obtaining Child Elements
ja: 子要素を入手する

source: Obtaining Parser State
ja: パーサー状態を入手する

source: Of course, for a user to receive a badge, you’ll need to create one.
ja: もちろん、バッジを受け取るユーザに対して、あなたはそれを作成する必要があるでしょう。

source: Offset this view by the horizontal and vertical amount specified in the offset parameter.
ja: このビューを、このオフセットパラメータにおいて指定された水平および垂直量だけオフセットします。

source: Offset this view by the specified horizontal and vertical distances.
ja: このビューをこの指定された水平および垂直間隔だけオフセットします。

source: Offsets the given index by the specified distance, or so that it equals the given limiting index.
ja: 与えられたインデックスを指定された間隔で補います、またはそれでそれは与えられた限界インデックスと等しくなります。

source: Offsets the given index by the specified distance.
ja: 与えられたインデックスを指定された間隔で補います。

source: Offsets the view by the horizontal and vertical distances in the given size.
ja: ビューをこの与えられた大きさにおける水平および垂直間隔だけ埋め合わせます。

source: Offsets the view by the specified horizontal and vertical distances.
ja: ビューをこの指定された水平および垂直間隔だけ埋め合わせます。

source: On This Page
ja: この項には

source: On iOS and tvOS, you must explicitly put the List into Edit Mode for the selection to apply.
ja: iOSとtvOSでは、あなたは明白にListをEdit Modeに置かなければなりません、selectionを適用するためには。

source: On iOS and watchOS the default is a wheel.
ja: iOSとwatchOSでは初期状態はホイールです。

source: On iOS, iPadOS, and tvOS, SwiftUI creates key commands for each of a group’s commands that has a keyboard shortcut.
ja: iOS、iPadOS、そしてtvOSでは、SwiftUIは、あるグループのもつコマンドそれらのそれぞれに対するキーコマンドを作成します、それはキーボードショートカットを持ちます。

source: On macOS, command groups are realized as collections of menu items in a menu bar menu.
ja: macOSでは、コマンドグループはあるメニューバーメニューの中のメニュー項目それらからなるコレクションとして実現されます。

source: On macOS, customization of the accent color is only applied if the “Multicolor” accent color is selected in System Preferences.
ja: macOSでは、アクセントカラーのカスタマイズは、“Multicolor” アクセントカラーがシステム環境設定において選択される場合に適用されるだけです。

source: On macOS, the default is a pop-up button.
ja: macOSでは初期状態はポップアップボタンです。

source: On the other hand, you can locally override the stack’s modifier by adding another to a specific child view:
ja: 他方では、あなたはローカルにスタックのもつ修飾子をオーバーライドすることが、別のものを特定の子ビューに加えることによって可能です：

source: On tvOS, the default is a segmented control.
ja: tvOSでは初期状態は分節コントロールです。

source: Once an XMLDTD instance is in place, you can add, remove, and change the XMLDTDNode objects representing various DTD declarations.
ja: いったんXMLDTDインスタンスの準備が整うならば、あなたは様々なDTD宣言を表しているXMLDTDNodeオブジェクトの追加、削除、そして変更が可能です。

source: Once the predicate returns false it will not be called again.
ja: いったん述部がfalseを返すならそれは再び呼び出されません。

source: One color stop in the gradient.
ja: 勾配の中の１つの色経由。

source: One of the allowed TouchBarItemPresence descriptions.
ja: 許可するTouchBarItemPresence記述の１つ。

source: One of the available font weights.
ja: 利用可能なフォントウェイトのうちの１つ。

source: Only document, element, and DTD nodes may have child nodes.
ja: 書類、要素、そしてDTDノードだけは、子ノードを持つかもしれません。

source: Open
ja: 開く

source: Open Recent submenu (managed automatically)
ja: 最近使った項目を開くサブメニュー（自動的に管理されます）

source: Operation types that determine how a drag and drop session resolves when the user drops a drag item.
ja: ユーザがあるドラッグ項目をドロップする時に、ドラッグ＆ドロップセッションはどのように解決するかを決定する操作型。

source: Operator
ja: 演算子

source: Operator Functions
ja: 演算子関数

source: Operators
ja: 様々な演算子

source: Options indicating whether the system uses standard or increased contrast between the app's foreground and background colors.
ja: システムが標準のまたは高めたコントラストをアプリのもつフォアグラウンドとバックグラウンドカラーの間で使うかどうかを指し示しているオプションそれら。

source: Options that affect user customization of the Touch Bar.
ja: Touch Barのユーザカスタマイズに影響を与えるオプション。

source: Options that control how adding a gesture to a view affect’s other gestures recognized by the view and its subvies.
ja: あるジェスチャをビューに加えることがビューとそれのサブビューによって認識される他のジェスチャにどのように影響するかを制御するオプション。

source: Otherwise, it uses the non-zero rule.
ja: そうでなければ、それは非ゼロ規則を使います。

source: Otherwise, returns (false, oldMember), where oldMember is the member of the set equal to newMember.
ja: そうでなければ、(false, oldMember)を返します、そこでoldMemberはnewMemberに等しいこの集合のメンバです。

source: Otherwise, the size of the frame in either dimension is:
ja: そうでなければ、どちらかの次元におけるフレームのサイズは：

source: Otherwise, the size of this view.
ja: それ以外では、このビューのサイズです。

source: Overridden by subclasses to substitute a custom class for an NSXML class that the parser uses to create node instances.
ja: あつらえのクラスを、パーサがノードインスタンスを作成するために使うNSXMLクラスの代わりにするために、サブクラスによってオーバーライドされます。

source: Override this property and return the root view of your SwiftUI view hierarchy from your implementation.
ja: このプロパティをオーバーライドして、そしてあなたのSwiftUIビュー階層のルートビューをあなたの実装から返してください。

source: Overrides the device for a preview.
ja: プレビューに対するデバイスをオーバーライドします。

source: Overrides the size of the container for the preview.
ja: プレビューに対するコンテナの大きさをオーバーライドします。

source: Overview
ja: 概要

source: Pads the view along all edge insets by the specified amount.
ja: ビューを全ての縁差込に沿ってこの指定された量だけ詰めます。

source: Pads the view using the specified edge insets.
ja: ビューをこの指定された縁差込を使って詰めます。

source: Page Setup
ja: ページ設定

source: Paints, Styles, and Gradients
ja: ペイント、スタイル、そして勾配

source: Parameters
ja: パラメータ

source: Parsing
ja: 構文解析

source: Pass false to use the non-zero winding number rule instead.
ja: falseを渡すことで、非ゼロ回転数規則を代わりに使います。

source: Pass nil or leave out a characteristic to indicate that the frame should adopt this view’s sizing behavior, constrained by the other non-nil arguments.
ja: nilを渡すまたはある特徴を省くことによって、そのフレームがこのビューのもつサイズ決定挙動を採用すべきであることを指し示してください、他の非nil引数による制約はされます。

source: Pass nil to disable the ability to move items.
ja: nilを渡すことで、項目を移動する能力を作動しないようにしてください。

source: Passes a single view written as a child view through unmodified.
ja: 子ビューとして書かれた単一のビューをまったく修正されないまま渡します。

source: Passing a sequence with no elements or an empty collection as possiblePrefix always results in true.
ja: １つの要素もないシーケンスまたは空のコレクションをpossiblePrefixとして渡すことは、常にtrueという結果になります。

source: Passing any other type of view results in a visible but empty tab item.
ja: 何らかの他の型のビューを渡すことは、ある変数しかし空のタブ項目という結果になります。

source: Passing the collection’s endIndex as the start parameter results in an empty subsequence.
ja: コレクションのendIndexをstartパラメータとして渡すことは、空のシーケンスという結果になります。

source: Passing the collection’s starting index as the end parameter results in an empty subsequence.
ja: コレクションの開始インデックスをendパラメータとして渡すことは、空のシーケンスという結果になります。

source: Paste and Match Style
ja: ペーストしてスタイルを合わせる

source: Pattern Matching
ja: パターンマッチング

source: Performing Actions
ja: アクションを実行する

source: Performing the Gesture
ja: ジェスチャを実行する

source: Performs the button’s action.
ja: ボタンのもつアクションを実行します。

source: Persistent Storage
ja: 永続ストレージ

source: Picker Styles
ja: ピッカースタイル

source: Plan your widget’s timeline to show timely, relevant information using dynamic views, and update the timeline when things change.
ja: あなたのウィジェットのもつタイムラインを計画することで、時宜を得た、関連した情報を動的ビューを使って表示してください、そしてそのタイムラインを物事が変化する時に更新してください。

source: Positioning a View
ja: ビューの位置決めをする

source: Positions the center of this view at the specified coordinates in its parent’s coordinate space.
ja: このビューの中心を、それの親のもつ座標空間におけるこの指定された座標に置きます。

source: Positions the center of this view at the specified point in its parent’s coordinate space.
ja: このビューの中心を、それの親のもつ座標空間におけるこの指定された点に置きます。

source: Positions the view within an invisible frame with the specified size.
ja: ビューを不可視フレーム内でこの指定された大きさで位置決めします。

source: Positions the view within an invisible frame with the specified width and height.
ja: ビューを不可視フレーム内でこの指定された幅と高さで位置決めします。

source: Positions this view within an invisible frame having the specified size constraints.
ja: ある目に見えないフレーム内でのこのビューの位置、この指定されたサイズ制約を持っています。

source: Positions this view within an invisible frame with the specified size.
ja: ある不可視フレーム内のこのビューの位置、この指定されたサイズでの。

source: Positions this view within an invisible frame.
ja: ある不可視フレーム内のこのビューの位置。

source: Positive angles rotate clockwise; negative angles rotate counterclockwise.
ja: 正の角度は時計回りに回転します；負の角度は反時計回りに回転します。

source: Possible values of the Increase Contrast user setting.
ja: Increase Contrastユーザ設定の可能な値。

source: Posted when the task has stopped execution.
ja: タスクが遂行を停止した時に投函されます。

source: PreferenceKey Implementations
ja: PreferenceKey実装

source: Preferences
ja: 環境設定

source: Present your content onscreen and handle user interactions.
ja: 画面上にあなたのコンテンツを提示します、そしてユーザ相互作用を取り扱います。

source: Presentations
ja: 提示

source: Presenting Action Sheets
ja: アクションシートを提示する

source: Presenting Additional Views
ja: 追加のビューを提示する

source: Presenting Alerts
ja: アラートを提示する

source: Presenting Popovers
ja: ポップオーバーを提示する

source: Presenting Sheets
ja: シートを提示する

source: Presenting the Interface Controller
ja: インターフェイスコントローラを提示する

source: Presents a StoreKit overlay when a given condition is true.
ja: StoreKitオーバーレイを、ある与えられた条件がtrueである時に提示します。

source: Presents a modal view that covers as much of the screen as possible using the given item as a data source for the sheet’s content.
ja: あるモーダルビューを提示します、それはできるだけ多くの画面を覆います、与えらた項目をシートのもつ内容に対するデータソースとして使って。

source: Presents a modal view that covers as much of the screen as possible when a given condition is true.
ja: あるモーダルビューを提示します、それはできるだけ多くの画面を覆います、ある与えられた条件がtrueである場合に。

source: Presents a popover using the given item as a data source for the popover’s content.
ja: ポップオーバーを提示します、与えられた項目をポップオーバーのもつ内容に対するデータソースとして使って。

source: Presents a popover when a given condition is true.
ja: ポップオーバーを提示します、与えられた条件がtrueの時に。

source: Presents a sheet using the given item as a data source for the sheet’s content.
ja: シートを提示します、与えられた項目をシートのもつ内容に対するデータソースとして使って。

source: Presents a sheet when a given condition is true.
ja: シートを提示します、与えられた条件がtrueの場合に。

source: Presents an action sheet using the given item as a data source for the sheet’s content.
ja: アクションシートを提示します、与えられた項目をシートのもつ内容に対するデータソースとして使って。

source: Presents an action sheet when a given condition is true.
ja: アクションシートを提示します、与えられた条件がrrueの場合に。

source: Presents an alert to the user.
ja: アラートをユーザに提示します。

source: Presents one or more new interface controllers modally using a page-based arrangement.
ja: １つ以上の新しいインターフェイスコントローラをモーダルにページ基盤整列を使って提示します。

source: Prevents the view from updating its child view when its new value is the same as its old value.
ja: ビューがそれの子ビューを更新することを、それの新しい値がそれの古い値と同じ場合に防止します。

source: Preview Creation
ja: プレビュー作成

source: Preview Customization
ja: プレビューカスタマイゼーション

source: PreviewProvider Implementations
ja: PreviewProvider実装

source: Previews
ja: プレビュー

source: Previews in Xcode
ja: Xcodeでプレビューする

source: Print
ja: 印刷

source: Programmatically
ja: プログラム的に

source: Provides a closure that vends the drag representation to be used for a particular data element.
ja: あるクロージャを提供します、それはドラッグ表現を製造販売して、特定のデータ要素に対して使われるようにします。

source: Provides a user visible name shown in the editor.
ja: エディタにおいて示されるユーザ可視の名前を提供します。

source: Provides functionality for exporting files.
ja: ファイルそれらをエクスポートすることに対する機能性を提供します。

source: Provides functionality for importing files.
ja: ファイルそれらをインポートすることに対する機能性を提供します。

source: Provides functionality for opening a URL.
ja: あるURLを開くことに対する機能性を提供します。

source: Provides support for “if” statements in multi-statement closures, producing an optional view that is visible only when the condition evaluates to true.
ja: “if” 文に対するサポートを複数文クロージャにおいて提供して、あるオプショナルビューを生み出します、それは条件がtrueに評価される時にのみ可視である

source: Providing Error User Info
ja: エラーユーザ情報を提供する

source: Providing Interactivity
ja: 相互作用性を提供する

source: Providing a Contextual Menu
ja: コンテキストメニューを提供する

source: Providing a Custom Coordinator Object
ja: あつらえのコーデネータオブジェクトを提供する

source: Providing a Hash Value
ja: ハッシュ値の提供

source: Quarter-circle rounded rect corners.
ja: ４分円まるめの矩形角。

source: Querying the Task State
ja: タスク状態を問い合わせる

source: Quit App
ja: アプリを終了

source: Read Composing SwiftUI Gestures to learn how you can create a sequence of two gestures.
ja: SwiftUIジェスチャを合成するを、どのようにあなたが２つのジェスチャのある連なりを作成できるか学ぶために読んでください。

source: Refer to a preview device by its name as shown Xcode’s run destination menu, like “iPhone X”, or using a model number, like “iPad8,1”.
ja: プレビューデバイスを参照してください、Xcodeの実行先メニューで示されるようにそれの名前によって、“iPhone X” のように、またはモデルナンバーを使って、“iPad8,1” のように。

source: Registers the provided value transformer with a given identifier.
ja: 提供された値変換子をある与えられた識別子で登録します。

source: Relate the controls that a ContextMenu contains to the context from which you show them.
ja: あるContextMenuメニューが含むコントロールそれらを、それからあなたがそれらを表示するところの文脈に関連付けます。

source: Related Documentation
ja: 関連文書

source: Relationships
ja: 関係

source: Removes a namespace node that is identified by a given prefix.
ja: 与えられた接頭辞によって識別される名前空間ノードを取り除きます。

source: Removes all elements of this option set that are not also present in the given set.
ja: このオプションセットに属し、また与えられたセットの中に含まれない、すべての要素を除去します。

source: Removes all existing children of the receiver and replaces them with an array of new child nodes.
ja: レシーバの全ての既存の子を取り除きます、そしてそれらを新しい子ノードそれらからなるある配列で置き換えます。

source: Removes an attribute node identified by name.
ja: 名前によって識別される属性ノードを取り除きます。

source: Removes the child node at a particular location in the receiver’s list of children.
ja: その子ノードを、ある特定の位置で、レシーバのもつ子それらのリストにおいて取り除きます。

source: Removes the child node of the receiver identified by a given index.
ja: 与えられたインデックスによって識別される、レシーバの子ノードを取り除きます。

source: Removes the child node of the receiver located at a specified position in its array of children.
ja: 子それらからなるそれの配列においてある指定された場所に位置する、レシーバの子ノードを取り除きます。

source: Removes the elements of the given set from this set.
ja: 与えられた集合の要素をこの集合から除去します。

source: Removes the given element and all elements subsumed by it.
ja: 与えられた要素とそれによって包括されるすべての要素を除去します。

source: Removes the given traits from this view.
ja: 与えられた特徴をビューから取り除きます。

source: Removes view behavior information that doesn’t apply to the view.
ja: ビューに適用しないビュー挙動情報を取り除きます。

source: Rendering
ja: レンダリング

source: Rendering a Button
ja: ボタンを描出する

source: Rendering a Toggle
ja: トグルを描出する

source: Replaces a child at a particular index with another child.
ja: ある子をある特定のインデックスで別の子と置き換えます。

source: Replaces a child node at a specified location with another child node.
ja: ある子ノードをある指定された位置で別の子ノードと置き換えます。

source: Replaces the child node of the receiver located at a specified position in its array of children with another node.
ja: 子それらからなるそれの配列の中の指定された場所に位置するレシーバの子ノードを別のノードで置き換えます。

source: Replaces the given index with its predecessor.
ja: 与えられたインデックスをそれの前のものと取り替えます。

source: Replaces the given index with its successor.
ja: 与えられたインデックスをそれの後に続くものと取り替えます。

source: Replaces this set with a new set containing all elements contained in either this set or the given set, but not in both.
ja: このセットを、このセットか与えられたセットのどちらかの中に、しかし両方ではなく、含まれるすべての要素を含んでいる新しいセットで置き換えます。

source: Representable objects to add SwiftUI views into your existing AppKit, UIKit, or WatchKit interfaces.
ja: SwiftUIビューがあなたの既存のAppKit、UIKit、またはWatchKitインターフェイスへと加える表現可能オブジェクト。

source: Resolve to a concrete modifier in the given environment.
ja: ある具象修飾子へとこの与えられたenvironmentにおいて解決します。

source: Resolving a Modifier
ja: 修飾子を解決する

source: Resources
ja: リソース

source: Respond to Gesture Callbacks
ja: ジェスチャコールバックに応答する

source: Respond to taps and gestures by adding gesture modifiers to your views.
ja: ジェスチャ修飾子をあなたのビューに加えることによってタップとジェスチャに応答してください。

source: Respond to taps, gestures, and other user interactions.
ja: タップ、ジェスチャ、そして他のユーザ相互作用に応答します。

source: Responding to Actions
ja: アクションに応答する

source: Responding to Gestures
ja: ジェスチャに応答する

source: Responding to Mouse Events
ja: マウスイベントに応答する

source: Responding to Touch Events
ja: タッチイベントに応答する

source: Responding to Updates
ja: 更新に応答する

source: Responding to View Preferences
ja: ビュープレファレンスに応答する

source: Responding to View-Related Events
ja: ビュー関連イベントに応答する

source: Resumes execution of the receiver task that had previously been suspended with a suspend() message.
ja: 以前にsuspend()メッセージで一時停止されたレシーバタスクの遂行を再開します。

source: Retrieving String Representations
ja: 文字列表現を回収する

source: Return true if the drop operation was successful; otherwise, return false.
ja: trueを返します、もしドロップ操作が上手くいったならば；そうでなければ、falseを返します。

source: Return nil only when the file is in a target that supports multiple platforms.
ja: nilを、ファイルが複数のプラットホームをサポートするターゲットの中にある場合にのみ返してください。

source: Return Value
ja: 戻り値

source: Return a drop proposal that contains the operation the delegate intends to perform at the DropInfo.location, The default implementation returns nil, which tells the drop to use that last valid returned value or else .copy.
ja: あるドロップ申し込みを返します、それは委任先がDropInfo.locationで実行するつもりである操作を含むものです、省略時の実装はnilを返します、それは、その最後の有効な戻り値かさもなければ.copyを使うようドロップに伝えます。

source: Return a new paint value matching self except using rect to map unit-space coordinates to absolute coordinates.
ja: ある新しいペイント（塗りつぶし）値を返します、selfと一致しています、ただしrectを使って単位空間座標を絶対座標にマップすることを除きます。

source: Returning Task Information
ja: タスク情報を返す

source: Returns self inset by amount.
ja: amountだけ縁差込したselfを返します。

source: Returns a XMLDTDNode object representing the DTD declaration for an element, attribute, entity, or notation based on a given string.
ja: XMLDTDNodeオブジェクトを返します、与えられた文字列に基づく要素、属性、エンティティ、または表記法に対するDTD宣言を表しています。

source: Returns a Boolean value indicating whether every element of a sequence satisfies a given predicate.
ja: シーケンスのすべての要素がある与えられたを満たすかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the initial elements of the sequence are equivalent to the elements in another sequence, using the given predicate as the equivalence test.
ja: シーケンスの最初の要素らが別のシーケンスの中の要素らと同等かどうかを、与えられた述部を同等性テストとして使って指し示すブール値を返します。

source: Returns a Boolean value indicating whether the initial elements of the sequence are the same as the elements in another sequence.
ja: シーケンスの最初の要素らが別のシーケンスの中の要素らと同じかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence contains an element that satisfies the given predicate.
ja: 指定された述部を満足させるある要素をシーケンスが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence contains the given element.
ja: 指定された要素をシーケンスが含むかどうかを指し示すブール値を返します。

source: Returns a Boolean value indicating whether the sequence precedes another sequence in a lexicographical (dictionary) ordering, using the given predicate to compare elements.
ja: シーケンスが別のシーケンスの前に来るかどうかをある語彙筆記的順序（字典）順序において、与えられた述部を使って要素を比較して、指し示すブール値を返します。
